<script>
export default {
    data() {
        return {
            host: ""
        }
    },
    async mounted() {
        let response = await fetch(`/api/info`, {
            method: "GET",
            headers: {}
        });

        if (response.ok) {
            let data = await response.json();
            this.host = data.host;
        }
    }
}
</script>

<template>
    <h3>AML и KYC</h3>

    Пользователи сервиса {{ host }} не должны находиться в перечне Specially Designated Nationals And Blocked Persons
    List (SDN) Human Readable Lists OFAC, а также в других перечнях и списках OFAC, которые запрещают пользоваться нашим
    сервисом.
    https://home.treasury.gov/policy-issues/financial-sanctions/specially-designated-nationals-and-blocked-persons-list-sdn-human-readable-lists.<br>

    Пользователи сервиса {{ host }} не могут быть физическими или юридическими лицами, являющимися гражданами или
    резидентами США, которым запрещено пользоваться нашим сервисом в соответствии с нормативными актами США, такими как
    законодательство, торговое эмбарго, акты Президента США, экономические санкции и т.д.<br>

    1. Сервис {{ host }} осуществляет свою деятельность в соответствии с законодательством государства, а также в
    соответствии с ратифицированными международными соглашениями:<br>
    1.1. Рекомендации по рискоориентированному подходу к виртуальным активам и поставщикам услуг по работе с
    виртуальными активами (FATF).<br>
    1.2. 5AMLD EU – Директива (EU) 2018/843 Европейского Парламента и Совета от 30 мая 2018 года, которой изменяется
    Директива (EU) 2015/849 о предотвращении использования финансовой системы для целей отмывания денег или
    финансирования терроризма и изменяются Директивы 2009/138/EC и 2013/36/EU (со ссылкой на EEA).<br>
    2. Для предотвращения легализации (отмывания) денежных средств и финансирования терроризма, Сервис {{ host }}
    оставляет за собой право отказаться от предоставления услуг по обмену на любом этапе, если есть подозрения в связи
    обмена с легализацией (отмыванием) денег, финансированием терроризма или иной противоправной деятельностью в
    соответствии с законодательством государства, в котором работает Сервис, государства, в котором проживает
    Пользователь, или в соответствии с международным законодательством.<br>
    3. Мы гарантируем защиту персональных данных наших пользователей в соответствии с законодательством того
    государства, где мы предоставляем наш сервис, а также согласно Конвенции о защите частных лиц в отношении
    автоматизированной обработки данных личного характера (СEД № 108).<br>
    4. Способы обработки и защиты персональных данных пользователей регулируются Политикой обработки и защиты
    персональных данных, размещенной на сайте нашего сервиса.<br>
    5. Если мы обнаружим фальсификацию (компрометацию) коммуникационных потоков или любое негативное влияние на
    нормальную работу программного кода нашего сервиса, которое связано с заявкой пользователя, мы приостановим ее
    выполнение. При этом мы произведем перерасчет параметров заявки, используя уже полученные средства и в соответствии
    с действующими условиями. Если пользователь не согласен с перерасчетом, мы вернем ему средства на его реквизиты.<br>
    6. Все споры, связанные с условиями данных Правил, должны разрешаться путем переговоров между сторонами. В случае
    невозможности достижения соглашения, споры подлежат рассмотрению в соответствии с законодательством страны, где
    находится ответчик.<br>
    7. Информация по операциям обмена хранится в базе данных Сервиса и является главным источником, на который опираются
    стороны оферты в случае спорных ситуаций, связанных с обменом.<br>
    8. Ответственность:<br>
    8.1. {{ host }} не несет ответственности перед своими Пользователями за любые финансовые потери, которые могут
    возникнуть в результате противоправных действий третьих лиц.<br>
    8.2. {{ host }} не несет ответственности за любые задержки или нереализованные Заявки, которые могут быть вызваны
    ошибкой Платежной системы или банка, указанных Пользователем в оформленной Заявке. В случае возникновения таких
    ситуаций, Пользователь соглашается с тем, что все претензии должны быть направлены в соответствующую Платежную
    систему или банк. {{ host }} оказывает содействие Пользователю в предоставлении документов, подтверждающих
    использование услуг Сервиса при подаче жалобы или требования администрации соответствующей Платежной системы или
    банка.<br>
    8.3. {{ host }} не проверяет правомочность и законность владения Пользователем криптовалютой, электронными деньгами
    или фиатной валютой, участвующими в конкретной Операции. {{ host }} предполагает добросовестность и легальность
    владения, пользования и распоряжения Пользователем банковскими картами (счетами) и Средствами на них, указываемых
    Пользователем при Платеже. {{ host }} не несет ответственности за владение, пользование и распоряжение Пользователем
    банковскими картами (счетами) и Средствами, ему не принадлежащими. Все риски и ответственность за владение,
    пользование и распоряжение банковскими картами (счетами) и Средствами на них, лежат на Пользователе.<br>
    9. Пользователь, принимая настоящие Правила, подтверждает следующее: 9.1. При использовании сервиса {{ host }}
    пользователь подтверждает, что предоставил правдивую информацию о себе и свои идентификационные данные являются
    подлинными.<br>
    9.2. Пользователь не принимает участие в операциях или сделках, связанных с отмыванием денег, в соответствии с
    правилами KYC & AML.<br>
    9.3. Доход пользователя не связан с противоправной деятельностью в соответствии с законодательством государства, где
    находится сервис {{ host }} или государства, где проживает пользователь, а также не нарушает правила KYC & AML.<br>
    9.4. Пользователь не находится в списках лиц, связанных с легализацией (отмыванием) доходов и финансированием
    терроризма на территории страны его проживания.<br>
    9.5. Пользователь не привлекался правоохранительными или фискальными органами государства своего проживания к
    юридической ответственности за легализацию (отмывание) доходов и финансирование терроризма, а также за совершение
    мошенничества или других противоправных действий, связанных с хищением чужого имущества.<br>
    9.6. Торговля криптовалютой и любые другие действия, связанные с оборотом криптовалюты, не нарушают законодательство
    государства проживания пользователя.<br>
    9.7 Пользователь обязуется не вмешиваться в работу Сервиса {{ host }} путем изменения его программного или
    аппаратного обеспечения или искажения передаваемых ему параметров (команд).<br>
    9.8 Пользователь несет ответственность за любой ущерб, который он может нанести Сервису {{ host }} в результате своих
    действий, независимо от наличия умысла или неосторожности. В случае нанесения ущерба, Пользователь обязуется
    полностью компенсировать его.<br>
    9.9 Если Пользователь получил оплату, превышающую установленную в Заявке сумму, он обязуется вернуть излишнюю сумму
    на реквизиты, предоставленные Сервисом {{ host }}. При этом комиссия за перевод средств оплачивается обменным
    пунктом.<br>
    9.10 Пользователь понимает и соглашается с тем, что Сервис {{ host }} не выступает в качестве финансового
    консультанта и не предоставляет консультационных услуг по инвестированию. Любая информация, передаваемая Сервисом
    {{ host }} Пользователю, не может рассматриваться как совет или руководство к действию.<br>
    9.11 Пользователь осознает и принимает на себя все риски, связанные с оборотом криптовалюты при использовании
    Сервиса {{ host }}<br>
</template>